Revit 2027 API
ScheduleFilter.SetValue(ElementId) Method
 Set the filter value to an ElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValue(
	ElementId id
)
Public Sub SetValue (
	id As ElementId
)
public:
void SetValue(
	ElementId^ id
)
member SetValue :
        id : ElementId -> unit
Parameters
id ElementId
 The filter value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace